# Read and Write CSV and XLS Files

In [1]:
import pandas as pd
df = pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [5]:
#write df to excel
df.to_excel('new.xlsx', sheet_name='weather_data')
df.to_excel('new_noindex.xlsx')

In [4]:
df.to_csv('new.csv')
df.to_csv('new_noindex.csv')

# GROUP-BY

In [7]:
df = pd.read_csv('weather_data_cities.csv')
#weather by cities
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [9]:
g = df.groupby('city')
g

In [11]:
for city,city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [12]:
#OR to get specific group

g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [13]:
#Find maximum temperature in each of the cities

print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [14]:
#find average temperature and windspeed

print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [15]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# Concatenate Data Frames

In [17]:
india_weather = pd.DataFrame({
    "city" : ["mumbai", "delhi", "bangalore"],
    "temperature" : [32, 45, 30],
    "humidity" : [80, 60, 78]
})

india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [19]:
us_weather = pd.DataFrame({
    "city" : ["newyork","chicago","Dartmouth"],
    "temperature" : [23, 34, 25],
    "humidity" : [80, 60, 78]
})

us_weather

        city  temperature  humidity
0    newyork           23        80
1    chicago           34        60
2  Dartmouth           25        78

In [20]:
#Concat Two DataFrames

df = pd.concat([india_weather,us_weather])
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0    newyork           23        80
1    chicago           34        60
2  Dartmouth           25        78

In [21]:
#IF you want continuous index then 

df = pd.concat([india_weather, us_weather], ignore_index = True)
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3    newyork           23        80
4    chicago           34        60
5  Dartmouth           25        78

In [24]:
df = pd.concat([india_weather, us_weather], axis=1)
df

        city  temperature  humidity       city  temperature  humidity
0     mumbai           32        80    newyork           23        80
1      delhi           45        60    chicago           34        60
2  bangalore           30        78  Dartmouth           25        78

# Merge DataFrames

In [26]:
temperature_df = pd.DataFrame({
    "city" : ["mumbai", "delhi", "bangalore", "hyderabad"],
    "temperature" : [32,334,45,46]
})

temperature_df

        city  temperature
0     mumbai           32
1      delhi          334
2  bangalore           45
3  hyderabad           46

In [27]:
humidity_df = pd.DataFrame({
    "city" : ["mumbai","bangalore","delhi"],
    "humidity" : [68,75,70]
})

humidity_df

        city  humidity
0     mumbai        68
1  bangalore        75
2      delhi        70

In [28]:
#merge two dataframes without explicitly mention index
#INNER JOIN

df = pd.merge(temperature_df, humidity_df, on="city")
df

        city  temperature  humidity
0     mumbai           32        68
1      delhi          334        70
2  bangalore           45        75

In [29]:
#OUTER JOIN

df = pd.merge(temperature_df, humidity_df, on="city", how="outer")
df

        city  temperature  humidity
0     mumbai           32      68.0
1      delhi          334      70.0
2  bangalore           45      75.0
3  hyderabad           46       NaN

# Numerical Indexing (.loc vs iloc)

In [30]:
import pandas as pd
import numpy as np

In [31]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,11], index=[45,44,43,42,41,40,39,38,37,36])
df

     0
45   1
44   2
43   3
42   4
41   5
40   6
39   7
38   8
37   9
36  11

### loc gives you value accoridng to the index available

In [43]:
df.loc[36]

0    11
Name: 36, dtype: int64

### iloc gives you value according to default row number

In [46]:
df.iloc[2]

0    3
Name: 43, dtype: int64

In [48]:
df.loc[:39]

    0
45  1
44  2
43  3
42  4
41  5
40  6
39  7

In [49]:
df.iloc[:5]

    0
45  1
44  2
43  3
42  4
41  5